handlers/discount-api/test/fixtures/supporter-plus/free-2-months.json

{
  "success": true,
  "id": "8ad083529010dd45019030d118cc63f5",
  "accountId": "8ad08ae29010dd3c019030a230cf6cfd",
  "accountNumber": "A00913302",
  "accountName": "001UD000006sVTFYA2",
  "invoiceOwnerAccountId": "8ad08ae29010dd3c019030a230cf6cfd",
  "invoiceOwnerAccountNumber": "A00913302",
  "invoiceOwnerAccountName": "001UD000006sVTFYA2",
  "subscriptionNumber": "A-S00898839",
  "version": 2,
  "revision": "2.0",
  "termType": "TERMED",
  "invoiceSeparately": false,
  "contractEffectiveDate": "2024-06-19",
  "serviceActivationDate": "2024-06-19",
  "customerAcceptanceDate": "2024-06-19",
  "subscriptionStartDate": "2024-06-19",
  "subscriptionEndDate": "2025-06-19",
  "lastBookingDate": "2024-06-19",
  "termStartDate": "2024-06-19",
  "termEndDate": "2025-06-19",
  "initialTerm": 12,
  "initialTermPeriodType": "Month",
  "currentTerm": 12,
  "currentTermPeriodType": "Month",
  "autoRenew": true,
  "renewalSetting": "RENEW_WITH_SPECIFIC_TERM",
  "renewalTerm": 12,
  "renewalTermPeriodType": "Month",
  "currency": "GBP",
  "contractedMrr": 10.00,
  "totalContractedValue": 120.00,
  "notes": null,
  "status": "Active",
  "TrialPeriodPrice__c": null,
  "CanadaHandDelivery__c": null,
  "AcquisitionMetadata__c": null,
  "QuoteNumber__QT": null,
  "GifteeIdentityId__c": null,
  "OpportunityName__QT": null,
  "LastQSSPaymentDate__c": null,
  "GiftNotificationEmailDate__c": null,
  "Gift_Subscription__c": "No",
  "TrialPeriodDays__c": null,
  "CreatedRequestId__c": "14de914c-decb-932b-0000-0000000047e0",
  "ActivationDate3__c": null,
  "AcquisitionSource__c": null,
  "CreatedByCSR__c": null,
  "CASSubscriberID__c": null,
  "LastPriceChangeDate__c": null,
  "InitialPromotionCode__c": "E2E_TEST_SPLUS_DEFAULT_ANNUAL",
  "Suspended__c": "false",
  "CpqBundleJsonId__QT": null,
  "RedemptionCode__c": null,
  "QuoteType__QT": null,
  "GiftRedemptionDate__c": null,
  "QuoteBusinessType__QT": null,
  "SupplierCode__c": null,
  "legacy_cat__c": null,
  "DeliveryAgent__c": null,
  "AcquisitionCase__c": null,
  "ReaderType__c": "Direct",
  "ActivationDate__c": null,
  "UserCancellationReason__c": null,
  "SuspensionStatus__c": "Active",
  "CardCountry__c": null,
  "OpportunityCloseDate__QT": null,
  "IPaddress__c": null,
  "IPCountry__c": null,
  "CancelledBy__c": null,
  "dummy__c": null,
  "PromotionCode__c": "E2E_TEST_SPLUS_DEFAULT_ANNUAL",
  "OriginalSubscriptionStartDate__c": null,
  "LegacyContractStartDate__c": null,
  "CancellationReason__c": null,
  "billToContact": {
    "id": "8ad08ae29010dd3c019030a230fc6d00",
    "address1": null,
    "address2": null,
    "city": null,
    "country": "United Kingdom",
    "county": null,
    "fax": null,
    "state": null,
    "postalCode": null,
    "firstName": "qweiuy123a",
    "lastName": "qweiuy123a",
    "nickname": null,
    "workEmail": "test.user+qweiuy123a@thegulocal.com",
    "personalEmail": null,
    "homePhone": null,
    "mobilePhone": null,
    "otherPhone": null,
    "otherPhoneType": null,
    "taxRegion": null,
    "workPhone": null,
    "contactDescription": null,
    "Company_Name__c": null,
    "SpecialDeliveryInstructions__c": null,
    "Title__c": null,
    "zipCode": null,
    "accountId": "8ad08ae29010dd3c019030a230cf6cfd",
    "accountNumber": "A00913302"
  },
  "paymentTerm": null,
  "invoiceTemplateId": null,
  "invoiceTemplateName": null,
  "sequenceSetId": null,
  "sequenceSetName": null,
  "soldToContact": {
    "id": "8ad08ae29010dd3c019030a230fc6d00",
    "address1": null,
    "address2": null,
    "city": null,
    "country": "United Kingdom",
    "county": null,
    "fax": null,
    "state": null,
    "postalCode": null,
    "firstName": "qweiuy123a",
    "lastName": "qweiuy123a",
    "nickname": null,
    "workEmail": "test.user+qweiuy123a@thegulocal.com",
    "personalEmail": null,
    "homePhone": null,
    "mobilePhone": null,
    "otherPhone": null,
    "otherPhoneType": null,
    "taxRegion": null,
    "workPhone": null,
    "contactDescription": null,
    "Company_Name__c": null,
    "SpecialDeliveryInstructions__c": null,
    "Title__c": null,
    "zipCode": null,
    "accountId": "8ad08ae29010dd3c019030a230cf6cfd",
    "accountNumber": "A00913302"
  },
  "isLatestVersion": true,
  "cancelReason": null,
  "ratePlans": [
    {
      "id": "8ad083529010dd45019030d1184963e8",
      "lastChangeType": "Add",
      "productId": "2c92c0f85721ff7c01572940171363db",
      "productName": "Discounts",
      "productSku": "SKU-00000044",
      "productRatePlanId": "8ad081dd8fd3d9df018fe2b6a7bc379d",
      "productRatePlanNumber": "PRP-00000242",
      "ratePlanName": "Cancellation Save Discount - Free for 2 months",
      "subscriptionProductFeatures": [],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": "SRP-01515493",
      "ratePlanCharges": [
        {
          "id": "8ad083529010dd45019030d1186b63eb",
          "originalChargeId": "8ad083529010dd45019030d1186b63eb",
          "productRatePlanChargeId": "8ad081dd8fd3d9df018fe2ba736f398e",
          "number": "C-01568701",
          "name": "Cancellation Save Discount - Free for 2 months",
          "productRatePlanChargeNumber": "PRPC-00000403",
          "type": "Recurring",
          "model": "DiscountPercentage",
          "uom": null,
          "version": 1,
          "subscriptionChargeDeliverySchedule": null,
          "numberOfDeliveries": null,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": "ONETIMERECURRINGUSAGE",
          "discountLevel": "subscription",
          "discountClass": null,
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": null,
          "specificListPriceBase": null,
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": null,
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 0.000000000,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2024-07-19",
          "effectiveEndDate": "2024-09-19",
          "processedThroughDate": null,
          "chargedThroughDate": null,
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Fixed_Period",
          "upToPeriodsType": "Months",
          "upToPeriods": 2,
          "specificEndDate": null,
          "mrr": 0.000000000,
          "dmrc": 0.000000000,
          "tcv": 0.000000000,
          "dtcv": 0.000000000,
          "originalOrderDate": "2024-06-19",
          "amendedByOrderOn": null,
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "salesPrice": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "100%  discount",
          "price": null,
          "discountAmount": null,
          "discountPercentage": 100.000000000
        }
      ]
    },
    {
      "id": "8ad083529010dd45019030d118d363f7",
      "productId": "2c92c0f85721ff7c01572940171363db",
      "productName": "Discounts",
      "productSku": "SKU-00000044",
      "productRatePlanId": "2c92c0f85721ff7c01572942235b6d7a",
      "productRatePlanNumber": "PRP-00000107",
      "ratePlanName": "Percentage",
      "subscriptionProductFeatures": [],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": "SRP-01515434",
      "ratePlanCharges": [
        {
          "id": "8ad083529010dd45019030d118d563f9",
          "originalChargeId": "8ad08ae29010dd3c019030a231526d09",
          "productRatePlanChargeId": "2c92c0f957220b5d0157299c97a60bbd",
          "number": "C-01568634",
          "name": "Percentage",
          "productRatePlanChargeNumber": "PRPC-00000169",
          "type": "Recurring",
          "model": "DiscountPercentage",
          "uom": null,
          "version": 1,
          "subscriptionChargeDeliverySchedule": null,
          "numberOfDeliveries": null,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": "ONETIMERECURRINGUSAGE",
          "discountLevel": "subscription",
          "discountClass": null,
          "billingDay": "DefaultFromCustomer",
          "listPriceBase": null,
          "specificListPriceBase": null,
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": null,
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": null,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2024-06-19",
          "effectiveEndDate": "2024-07-19",
          "processedThroughDate": "2024-06-19",
          "chargedThroughDate": "2024-07-19",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Fixed_Period",
          "upToPeriodsType": "Months",
          "upToPeriods": 1,
          "specificEndDate": null,
          "mrr": 0.000000000,
          "dmrc": 0.000000000,
          "tcv": 0.000000000,
          "dtcv": 0.000000000,
          "originalOrderDate": "2024-06-19",
          "amendedByOrderOn": null,
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "salesPrice": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "1%  discount",
          "price": null,
          "discountAmount": null,
          "discountPercentage": 1.000000000
        }
      ]
    },
    {
      "id": "8ad083529010dd45019030d118d863fc",
      "productId": "8ad09fc281de1ce70181de3b23b2363d",
      "productName": "Supporter Plus",
      "productSku": "SKU-00000072",
      "productRatePlanId": "8ad08cbd8586721c01858804e3275376",
      "productRatePlanNumber": "PRP-00000225",
      "ratePlanName": "Supporter Plus V2 - Monthly",
      "subscriptionProductFeatures": [],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": "SRP-01515435",
      "ratePlanCharges": [
        {
          "id": "8ad083529010dd45019030d118da63fe",
          "originalChargeId": "8ad08ae29010dd3c019030a231796d10",
          "productRatePlanChargeId": "8ad08cbd8586721c01858804e3715378",
          "number": "C-01568635",
          "name": "Subscription",
          "productRatePlanChargeNumber": "PRPC-00000361",
          "type": "Recurring",
          "model": "FlatFee",
          "uom": null,
          "version": 1,
          "subscriptionChargeDeliverySchedule": null,
          "numberOfDeliveries": null,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "specificListPriceBase": null,
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.000000000,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2024-06-19",
          "effectiveEndDate": "2025-06-19",
          "processedThroughDate": "2024-06-19",
          "chargedThroughDate": "2024-07-19",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 10.000000000,
          "dmrc": 10.000000000,
          "tcv": 120.000000000,
          "dtcv": 120.000000000,
          "originalOrderDate": "2024-06-19",
          "amendedByOrderOn": null,
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "salesPrice": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "GBP10",
          "price": 10.000000000,
          "discountAmount": null,
          "discountPercentage": null
        },
        {
          "id": "8ad083529010dd45019030d118db6400",
          "originalChargeId": "8ad08ae29010dd3c019030a2317f6d11",
          "productRatePlanChargeId": "8ad09ea0858682bb0185880ac57f4c4c",
          "number": "C-01568636",
          "name": "Contribution",
          "productRatePlanChargeNumber": null,
          "type": "Recurring",
          "model": "FlatFee",
          "uom": null,
          "version": 1,
          "subscriptionChargeDeliverySchedule": null,
          "numberOfDeliveries": null,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "specificListPriceBase": null,
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.000000000,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2024-06-19",
          "effectiveEndDate": "2025-06-19",
          "processedThroughDate": "2024-06-19",
          "chargedThroughDate": "2024-07-19",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 0.000000000,
          "dmrc": 0.000000000,
          "tcv": 0.000000000,
          "dtcv": 0.000000000,
          "originalOrderDate": "2024-06-19",
          "amendedByOrderOn": null,
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "salesPrice": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "GBP0",
          "price": 0.000000000,
          "discountAmount": null,
          "discountPercentage": null
        }
      ]
    }
  ],
  "orderNumber": "O-00913594",
  "externallyManagedBy": null,
  "statusHistory": [
    {
      "startDate": "2024-06-19",
      "endDate": "2025-06-19",
      "status": "Active"
    },
    {
      "startDate": "2025-06-19",
      "endDate": null,
      "status": "OutOfTerm"
    }
  ],
  "invoiceGroupNumber": null,
  "createTime": "2024-06-19 15:05:28",
  "updateTime": "2024-06-19 15:05:28"
}